# --- Essential CLI Tools ---
brew "mas"             # Mac App Store CLI
brew "git"
brew "python"
brew "nvm"
brew "wget"

# --- Development ---
cask "visual-studio-code"
cask "warp"

# --- Productivity ---
cask "rectangle"

# --- Communication ---
cask "discord"
cask "whatsapp"

# --- Browsers ---
cask "google-chrome"

# --- Media ---
cask "spotify"
cask "vlc"

# --- Utilities ---
cask "tailscale"

# --- Mac App Store (optional) ---
mas "Xcode", id: 497799835
max "Perplexity", id: 6714467650